In [3]:
from sklearn.preprocessing import OneHotEncoder
import pandas as pd

In [7]:
data=pd.DataFrame({
    "Hero":["T","W","B","I","S","L"],
    "Movie":["Marvel","Disney","Marvel","Disney","Marvel","Paramount"],
    "Seuqel":[4,2,8,3,2,6]
})

In [12]:
data.head()

  Hero   Movie  Seuqel
0    T  Marvel       4
1    W  Disney       2
2    B  Marvel       8
3    I  Disney       3
4    S  Marvel       2

In [15]:
ohe=OneHotEncoder()
result=ohe.fit_transform(data[["Hero"]]).toarray()
result=pd.DataFrame(result,columns=["B","I","L","S","T","W"])
data1=pd.concat([data,result],axis=1)
data1.drop("Hero",axis=1,inplace=True)
data1

       Movie  Seuqel    B    I    L    S    T    W
0     Marvel       4  0.0  0.0  0.0  0.0  1.0  0.0
1     Disney       2  0.0  0.0  0.0  0.0  0.0  1.0
2     Marvel       8  1.0  0.0  0.0  0.0  0.0  0.0
3     Disney       3  0.0  1.0  0.0  0.0  0.0  0.0
4     Marvel       2  0.0  0.0  0.0  1.0  0.0  0.0
5  Paramount       6  0.0  0.0  1.0  0.0  0.0  0.0

In [16]:
data1=pd.get_dummies(data,columns=["Hero"],dtype="int",drop_first=True)
data1

       Movie  Seuqel  Hero_I  Hero_L  Hero_S  Hero_T  Hero_W
0     Marvel       4       0       0       0       1       0
1     Disney       2       0       0       0       0       1
2     Marvel       8       0       0       0       0       0
3     Disney       3       1       0       0       0       0
4     Marvel       2       0       0       1       0       0
5  Paramount       6       0       1       0       0       0

In [17]:
result2=ohe.fit_transform(data[["Hero","Movie"]]).toarray()
result2

array([[0., 0., 0., 0., 1., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 1., 1., 0., 0.],
       [1., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 1., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 1., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 1.]])

In [22]:
pd.get_dummies(data,columns=["Hero","Movie"],dtype="int") # multiple columns

   Seuqel  Hero_B  Hero_I  Hero_L  Hero_S  Hero_T  Hero_W  Movie_Disney  Movie_Marvel  Movie_Paramount
0       4       0       0       0       0       1       0             0             1                0
1       2       0       0       0       0       0       1             1             0                0
2       8       1       0       0       0       0       0             0             1                0
3       3       0       1       0       0       0       0             1             0                0
4       2       0       0       0       1       0       0             0             1                0
5       6       0       0       1       0       0       0             0             0                1